---
kind: other
id: Methods.T:Autodesk.Revit.DB.ParameterValuePresenceRule
source: html/f160f150-198e-614a-3fd2-1b0d9214008c.htm
---
# ParameterValuePresenceRule Methods

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.